export const hangulChars = [
  "가",
  "나",
  "다",
  "라",
  "마",
  "바",
  "사",
  "아",
  "자",
  "차",
  "카",
  "타",
  "파",
  "하",
];

export const englishChars = [
  "a",
  "b",
  "c",
  "d",
  "e",
  "f",
  "g",
  "h",
  "i",
  "j",
  "k",
  "l",
  "m",
  "n",
  "o",
  "p",
  "q",
  "r",
  "s",
  "t",
  "u",
  "v",
  "w",
  "x",
  "y",
  "z",
];

export const characters =
  "가각간갇갈감갑값갓강갖개객갤갬갭갱갸걀걍걔거걱건걸검겁것겅겉게겐겔겜겝겟겡겨격견겯결겸겹겻경곁계고곡곤곧골곬곰곱곳공곶과곽관괄괌광괘괴괵굄굉교구국군굳굴굼굽굿궁궈권궐궤귀귄규균귤그극근귿글금급긋긍긔긧기긱긴길김깁깃깅까깍깐깔깜깝깟깡깨깽꺼꺽껀껄껌껍껏껑께껨껭껴꼉꼬꼭꼰꼴꼼꼽꼿꽁꽂꽃꽐꽝꾔꾥꾀꾸꾹꾼꿀꿈꿉꿋꿍뀨꿔꿜꿩꿰뀀뀌끄끈끌끔끗끙끝끼끽낀낄낌낏나낙낚난낟날낢남납낫낭낮낯낱내낸냄냅냉냐냔냠냥냬너넉넌널넘넛넝넋넣네넥넨넬넴넷넹녀녁년녈념녑녓녕녜노녹논놀놈놉놋농놓뇌뇨뇰뇸뇽누눅눈눌눔눕눙뉘뉴뉵늄늉느늑는늘늙늠늡늣능늦늪늬니닉닌닐님닙닛닝닢다닥단달닭담답닷당닻닿대댁댄댈댐댓댕댜댱더덕던덛덜덤덥덧덩덫데덱덴델댐댑댃댅댌도독돈돌돐돔돗동돛돝돠돼되된됨됭됴두둑둔둘둠둡둥둬뒈뒤듀듁듄듕드득든들듬듭듯등듸딍디딕딘딜딤딥딧딩딮따딱딴딸땀땅때땍땐땜땡떠떡떤떨떰떳떵떼떽뗑또똑똔똘똠똥뚜뚝뚠뚤뚬뚱뛰뜀뜨뜬뜰뜸뜻뜽띔띠띨띰띵라락란랄람랍랏랑랒랗래랙랜랠램랩랫랭랴락랜랠램랩랫랭랴략랸량러럭런럴럼럽렛령뢰뤄류륙륜륨륭르륵른를림립릿링마막만맏말맘맛망맡맑많매맥맨맴맵맷맹머먹먼멀멈멋멍메멕멘멜멤멧며멱면멸몃명몇몌모목몬몰몸몹못몽뫼묑묘무묵문물뭄뭇뭉뭍뭐뮈뮌뮤뮨뮬므믄믈믓믜미믹민믿밀밈밋밍밑바박반발밤밥밧방밭밖배백밴밸뱀뱃뱅버벅번벋벌범법벗벙벚베벡벤벨벰벳벵벼벽변별볏병볕보복본볼봄봅봇봉봐뵈부북분불붐붑붓붕붙뷔뷜뷰뷹브블뷨비빅빈빌빔빗빙빚빛빠빡빨빰빱빵빼빽뺌뺨뻐뻑뻔뻘뻥뻬뼈뼉뼘뼛뽀뽁뽄뽈뽐뽕뿅뿌뿍뿐뿔뿜뿡쁘쁠삐삑삔삣삥사삭삯산살삵삶삼삽삿상샃샅새색샌샘샛생샤샥샨샬샴샵샷샹섄서석선설섬섭섯성섶세섹센셀셈셉셋셔셕션셜셤셥셧셩셰셴셸소속솎손솔솜솝솟송솥솨쇄쇅쇠쇼쇽숀숄숍숏숑수숙순술숨숫숭숯숱숲숴쉐쉔쉘쉬쉰쉼쉽쉿슈슉슌슐슘슛슝스슥슬슴습슷승슭싀시식신실심십싯싱싸싹싼쌀쌈쌍쌰쌔쌕쌤써썩썬썰썸썹썽쎄쎈쎌쏘쏙쏜쏠쏨쏭쏴쐐쐬쑈쑤쑥쑨쑬쑹쒜쒸쓰쓱쓴쓸씀씁씨씩씬씰씸씹씽아악안않알앓암압앗앙앞애액앤앨앰앱앳앵야약얀얄얌얍얏양얕얘어억언얼엄업엇엉엊에엔엘엠엣엥여역연엳열염엽엿영옆예옌옐옛오옥온올옳옴옷옹옻와왁완왈왑왓왕왜왠외왼요욕욘욜욤용우욱운울욹움웁웃웅워웍원월웜웡웨웬웰웹위윈윌윔윕윗윙유육윤율윰융윷으윽은을음읍읏응의읫이익인일임입잇잉잎자작잔잘잠잡잣장재잭잴잼잽쟁쟈쟉쟌쟝저적전절점접젓정젖제젝젠젤젬젯져젹젼졀졉졋졍졔조족존졸좀좃종좆좋좌좍좡죄죠죄죤죵주죽준줄줅줌중줴쥐쥔쥬쥭쥰쥴즈즉즌즐즘즙즛증지직진질짐집짓징짚짜짝짠짤짬짱째짹쨍쩌쩍쩐쩔쩜쩝쩡쪼쪽쫄쫌쫑쫙쭈쭉쭌쭐쭝쮸쯔쯜쯩찌찍찐찔찜찝찢찟찡차착찬찰참찹창채책챌챔챗챙챠챰챵처척천철첨첩첫청체첵첸첼쳇쳉쳐쳑쳔쳥초촉촌촐촘총촬최쵸쵹춍추축춘출춤충췌취츄츈츠측츤츩츰츳층츼치칙친칠칡침칩칫칭ㅋ카칵칸칼캄캅캉캐캔캠캡캣캥컁커컥컨컬컴컵컷컹케켄켈켐켜켠코콕콘콜콤콥콧콩콰콸쾅쾌쾨쾰쿄쿠쿡쿤쿨쿰쿵퀄퀑퀴퀵퀸큐큘크큰클큼킁키킥킨킬킴킵킷킹타탁탄탈탐탑탕태택탠탬탭탯탱터턱턴털텀텁텅테텍텐텔템텟텡텨텬톄톈토톡톤톨톰톱톳통퇴툐투툭툰툴툼툽튕튀튐튜튝튠튱트특튼틀틈틔티틱틴틸팀팁팅파팍팎판팔팜팝팟팡팥패팩팬팰팸팻팽퍅퍼퍽펀펄펌펍펏펑페펙펜펠펩펫펭펴펵편폄평폐포폭폰폴폼폿퐁푀표푸푹푼풀품풋풍퓨프플픗피픽핀필핌핍핏핑ㅎ하학한할함합핫항해핵핸햄햇행햐향허헉헌헐험헛헝헤헥헨헬헴헷헹혀혁현혈혐협형혜호혹혼홀홈홉홍화확환활황홰횃회획횡효후훅훈훌훔훗훙훠훤훨훼휘휠휩휴휼흉흐흑흔흘흙흠흡흥희흰히힌힐힘힙힝";

export function isLowercaseLetter(char: string) {
  return /^[a-z]$/.test(char);
}
